c5/src/InformationRegisters/Bank/Bank.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Bank</name>
  <resources>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <resources>
    <name>Analytics</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </resources>
  <resources>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </resources>
  <resources>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </resources>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </resources>
  <resources>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </resources>
  <resources>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>DeletionMark</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Posted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DefinedType.Bank</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Membership</name>
  <dimensions>
    <name>Membership</name>
    <comment>Do not use name &quot;Group&quot;</comment>
    <type>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/Rights/Rights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Rights</name>
  <resources>
    <name>Access</name>
    <type>
      <types>EnumRef.AllowDeny</types>
    </type>
  </resources>
  <resources>
    <name>Expiration</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Warning</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Disabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Target</name>
    <type>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Action</name>
    <type>
      <types>EnumRef.AccessRights</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>CatalogRef.Metadata</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DateStart</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Method</name>
    <type>
      <types>EnumRef.RestrictionMethods</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/RestrictionMethods/RestrictionMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RestrictionMethods</name>
  <enumValues>
    <name>Period</name>
  </enumValues>
  <enumValues>
    <name>Duration</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/AccessRights/AccessRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AccessRights</name>
  <enumValues>
    <name>Any</name>
  </enumValues>
  <enumValues>
    <name>Edit</name>
  </enumValues>
  <enumValues>
    <name>Create</name>
  </enumValues>
  <enumValues>
    <name>UndoPosting</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Metadata/Metadata.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Metadata</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>AccountingRegisters</name>
      <description>Accounting registers</description>
    </items>
    <items>
      <name>AccumulationRegisters</name>
      <description>Accumulation registers</description>
    </items>
    <items>
      <name>BusinessProcesses</name>
      <description>Business processes</description>
    </items>
    <items>
      <name>CalculationRegisters</name>
      <description>Calculation registers</description>
    </items>
    <items>
      <name>Catalogs</name>
      <description>Catalogs</description>
    </items>
    <items>
      <name>ChartsOfAccounts</name>
      <description>Charts of accounts</description>
    </items>
    <items>
      <name>ChartsOfCalculationTypes</name>
      <description>Charts of calculation types</description>
    </items>
    <items>
      <name>ChartsOfCharacteristicTypes</name>
      <description>Charts of feature types</description>
    </items>
    <items>
      <name>DataProcessors</name>
      <description>Data processors</description>
    </items>
    <items>
      <name>DocumentJournals</name>
      <description>Document journals</description>
    </items>
    <items>
      <name>Documents</name>
      <description>Documents</description>
    </items>
    <items>
      <name>Enums</name>
      <description>Enums</description>
    </items>
    <items>
      <name>ExchangePlans</name>
      <description>Exchange plans</description>
    </items>
    <items>
      <name>InformationRegisters</name>
      <description>Information registers</description>
    </items>
    <items>
      <name>Reports</name>
      <description>Reports</description>
    </items>
    <items>
      <name>Subsystems</name>
      <description>Subsystems</description>
    </items>
    <items>
      <name>Tasks</name>
      <description>Tasks</description>
    </items>
  </predefined>
  <attributes>
    <name>ExplanationEN</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExplanationRO</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExplanationRU</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>NotFound</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SynonymEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SynonymRO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SynonymRU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Membership</name>
  <predefined>
    <items>
      <name>Users</name>
      <description>Users</description>
    </items>
  </predefined>
  <attributes>
    <name>TenantAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tenants</name>
    <attributes>
      <name>Tenant</name>
      <type>
        <types>CatalogRef.Tenants</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/DocumentEvents/Module.bsl
Procedure CheckDate ( Source, Cancel, CheckedAttributes ) export
	
	if ( Source.Date = Date ( 1, 1, 1 ) ) then
		return;
	endif; 
	if ( Source.Date < Date ( "20000101" ) ) then
		Output.DocumentDateError1 ( , "Date" );
	elsif ( Source.Date > Date ( "21000101" ) ) then
		Output.DocumentDateError2 ( , "Date" );
	endif; 
	
EndProcedure

Procedure Prefix ( Source, StandardProcessing, Prefix ) export
	
	px = Application.Prefix ();
	if ( px <> "" ) then
		Prefix = px;
	endif;
	if ( exception ( Source ) ) then
		return;
	endif; 
	Prefix = Prefix + Source.Company.Prefix;
	
EndProcedure

Function exception ( Source )
	
	type = TypeOf ( Source );
	return
		type = Type ( "DocumentObject.AgentPayment" )
		or type = Type ( "DocumentObject.Document" )
		or type = Type ( "DocumentObject.DocumentVersion" )
		or type = Type ( "DocumentObject.IncomingEmail" )
		or type = Type ( "DocumentObject.OutgoingEmail" )
		or type = Type ( "DocumentObject.ProjectsInvoice" )
		or type = Type ( "DocumentObject.ProjectsPayment" )
		or type = Type ( "DocumentObject.TenantOrder" )
		or type = Type ( "DocumentObject.TenantPayment" )
		or type = Type ( "DocumentObject.TimeEntry" )
		or type = Type ( "DocumentObject.Timesheet" )
		or type = Type ( "DocumentObject.Entry" )
		or type = Type ( "DocumentObject.InvoiceRecord" );
	
EndFunction 
	
Procedure BankEnrollment ( Source ) export
	
	InformationRegisters.Bank.Enroll ( Source );
	
EndProcedure

Procedure CheckAccess ( Source, Cancel, WriteMode, PostingMode ) export
	
	if ( Cancel
		or Source.DataExchange.Load
		or Logins.Admin () ) then
		return;
	endif; 
	Cancel = not writingAllowed ( Source );

EndProcedure

Function writingAllowed ( Source )
	
	rights = getRights ( Source );
	access = getAccess ( Source, rights );
	if ( not access.Allowed ) then
		if ( access.Action = undefined ) then
			Output.DocumentRightsUndefined ( new Structure ( "User", SessionParameters.User ) );
		else
			Output.DocumentModificationIsNotAllowed ( new Structure ( "User, Action", SessionParameters.User, access.Action ) );
		endif; 
	endif; 
	return access.Allowed;
	
EndFunction

Function getRights ( Source )
	
	rightsMap = new Map ();
	table = getRightsTable ( Source );
	for each row in table do
		if ( rightsMap [ row.Action ] = undefined ) then
			rightsMap [ row.Action ] = row.Access;
		endif; 
	enddo; 
	return rightsMap;
	
EndFunction 

Function getRightsTable ( Source )
	
	s = "
	|select undefined as User
	|into UserAndGroups
	|union
	|select &User
	|union
	|select Users.Membership
	|from InformationRegister.Membership as Users
	|where Users.User = &User
	|and not Users.Membership.DeletionMark
	|;
	|select Rights.Access as Access, Rights.Action as Action,
	|	case when Rights.Target = undefined then 0
	|			+ case when Rights.Document <> value ( Catalog.Metadata.EmptyRef ) then 5 else 0 end
	|			+ case when Rights.Access = value ( Enum.AllowDeny.Deny ) then 1000 else 0 end
	|		when Rights.Target refs Catalog.Membership then 10
	|			+ case when Rights.Document <> value ( Catalog.Metadata.EmptyRef ) then 5 else 0 end
	|			+ case when Rights.Access = value ( Enum.AllowDeny.Deny ) then 1000 else 0 end
	|		else 100
	|			+ case when Rights.Document <> value ( Catalog.Metadata.EmptyRef ) then 5 else 0 end
	|			+ case when Rights.Access = value ( Enum.AllowDeny.Deny ) then 1000 else 0 end
	|	end as Weight
	|from InformationRegister.Rights as Rights
	|where Rights.Target in ( select User from UserAndGroups )
	|and Rights.Document in ( value ( Catalog.Metadata.EmptyRef ), Document = &Document )
	|and ( ( Rights.Method = value ( Enum.RestrictionMethods.Period )
	|	and &DocumentDate > Rights.DateStart
	|	and ( &DocumentDate < Rights.DateEnd or Rights.DateEnd = datetime ( 1, 1, 1 ) ) )
	|	or ( Rights.Method = value ( Enum.RestrictionMethods.Duration )
	|	and Rights.Access = value ( Enum.AllowDeny.Deny )
	|	and datediff ( &DocumentDate, &OperationalTime, day ) >= Rights.Duration )
	|	or ( Rights.Method = value ( Enum.RestrictionMethods.Duration )
	|	and Rights.Access = value ( Enum.AllowDeny.Allow )
	|	and datediff ( &DocumentDate, &OperationalTime, day ) <= Rights.Duration )
	|	or Rights.Method = value ( Enum.RestrictionMethods.EmptyRef ) )
	|and ( &OperationalTime < Rights.Expiration or Rights.Expiration = datetime ( 1, 1, 1 ) )
	|order by Weight desc
	|";
	q = new Query ( s );
	q.TempTablesManager = new TempTablesManager ();
	q.SetParameter ( "User", SessionParameters.User );
	q.SetParameter ( "Document", MetadataRef.Get ( Source.Metadata ().FullName () ) );
	q.SetParameter ( "DocumentDate", Source.Date );
	q.SetParameter ( "OperationalTime",	Max ( GetRealTimeTimestamp (), CurrentDate () ) );
	return q.Execute ().Unload ();
	
EndFunction 

Function getAccess ( Source, Rights )
	
	result = new Structure ( "Allowed, Action", false, undefined );
	if ( Source.IsNew () ) then
		if ( Rights [ Enums.AccessRights.Create ] = Enums.AllowDeny.Deny ) then
			result.Action = Enums.AccessRights.Create;
		elsif ( Rights [ Enums.AccessRights.Any ] = Enums.AllowDeny.Deny ) then
			result.Action = Enums.AccessRights.Any;
		elsif ( Rights [ Enums.AccessRights.Create ] = Enums.AllowDeny.Allow
			or Rights [ Enums.AccessRights.Any ] = Enums.AllowDeny.Allow ) then
			result.Allowed = true;
		endif;
	elsif ( Rights [ Enums.AccessRights.Edit ] = Enums.AllowDeny.Deny ) then
		result.Action = Enums.AccessRights.Edit;
	elsif ( Rights [ Enums.AccessRights.UndoPosting ] = Enums.AllowDeny.Deny ) then
		result.Action = Enums.AccessRights.UndoPosting;
	elsif ( Rights [ Enums.AccessRights.Any ] = Enums.AllowDeny.Deny ) then
		result.Action = Enums.AccessRights.Any;
	elsif ( Rights [ Enums.AccessRights.Edit ] = Enums.AllowDeny.Allow
		or Rights [ Enums.AccessRights.UndoPosting ] = Enums.AllowDeny.Allow
		or Rights [ Enums.AccessRights.Any ] = Enums.AllowDeny.Allow ) then
		result.Allowed = true;
	endif; 
	return result;
	
EndFunction

Procedure CheckInvoice ( Source, Cancel, WriteMode, PostingMode ) export
	
	if ( Source.IsNew ()
		or canChange ( Source ) ) then
		return;
	endif;
	Cancel = true;
	Output.InvoicePrinted ();
	
EndProcedure

Function canChange ( Source ) 

	invoice = InvoiceRecordsSrv.Search ( Source.Ref );
	if ( invoice = undefined ) then
		return true;
	else
		return changesAllowed ( DF.Pick ( invoice, "Status" ) );
	endif;

EndFunction

Function changesAllowed ( Status )
	
	return Status.IsEmpty ()
	or Status = Enums.FormStatuses.Saved
	or Status = Enums.FormStatuses.Canceled;
	
EndFunction
